locus/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-14 Sun 23:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Locus Project</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Locus Project</h1>

<div id="outline-container-org52888f6" class="outline-2">
<h2 id="org52888f6">Introduction</h2>
<div class="outline-text-2" id="text-org52888f6">
<p>
The Locus project is for analysis of extreme precipitation patterns in the United States. We're developing the Algorithms to extract, analyse and visualize the precipitation patterns for basins based on their Hydrologic Unit Code (HUC), so that it can be applied to any watershed.
</p>

<p>
Git repo: <a href="https://github.com/Atreyagaurav/locus-code-usace">https://github.com/Atreyagaurav/locus-code-usace</a>
</p>

<p>
Data used:
</p>
<ul class="org-ul">
<li>Livneh Dataset for Precipitation</li>
<li>USGS dataset for Water boundary</li>
</ul>
</div>
</div>

<div id="outline-container-org29cf9eb" class="outline-2">
<h2 id="org29cf9eb">Example Results</h2>
<div class="outline-text-2" id="text-org29cf9eb">
<p>
Here are example visualization of the different patterns in some basins
</p>

<ul class="org-ul">
<li><a href="https://atreyagaurav.github.io/locus/interactive.html">Interactive Page</a></li>
<li>Individual maps can be accessed here:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Basin</th>
<th scope="col" class="org-right">HUC</th>
<th scope="col" class="org-left">Extreme Precipitation Type</th>
<th scope="col" class="org-left">Length of Event</th>
<th scope="col" class="org-left">Link</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Ohio</td>
<td class="org-right">05</td>
<td class="org-left">AMS</td>
<td class="org-left">1 day</td>
<td class="org-left"><a href="https://atreyagaurav.github.io/locus/05-ohio-region/map-ams-1day.html">05-ams-1day.html</a></td>
</tr>

<tr>
<td class="org-left">Ohio</td>
<td class="org-right">05</td>
<td class="org-left">PDS</td>
<td class="org-left">1 day</td>
<td class="org-left"><a href="https://atreyagaurav.github.io/locus/05-ohio-region/map-pds-1day.html">05-pds-1day.html</a></td>
</tr>

<tr>
<td class="org-left">Trinity</td>
<td class="org-right">1203</td>
<td class="org-left">AMS</td>
<td class="org-left">1 day</td>
<td class="org-left"><a href="https://atreyagaurav.github.io/locus/1203-trinity/map-ams-1day.html">1203-ams-1day.html</a></td>
</tr>

<tr>
<td class="org-left">Trinity</td>
<td class="org-right">1203</td>
<td class="org-left">PDS</td>
<td class="org-left">1 day</td>
<td class="org-left"><a href="https://atreyagaurav.github.io/locus/1203-trinity/map-pds-1day.html">1203-pds-1day.html</a></td>
</tr>

<tr>
<td class="org-left">North Branch Potomac</td>
<td class="org-right">02070002</td>
<td class="org-left">AMS</td>
<td class="org-left">1 day</td>
<td class="org-left"><a href="https://atreyagaurav.github.io/locus/02070002-north-branch-potomac/map-ams-1day.html">02070002-ams-1day.html</a></td>
</tr>

<tr>
<td class="org-left">North Branch Potomac</td>
<td class="org-right">02070002</td>
<td class="org-left">PDS</td>
<td class="org-left">1 day</td>
<td class="org-left"><a href="https://atreyagaurav.github.io/locus/02070002-north-branch-potomac/map-pds-1day.html">02070002-pds-1day.html</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-05-14 Sun 23:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
